Revit 2027 API
RailingType.SecondaryHandrailHeight Property
 The height of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SecondaryHandrailHeight { get; }
Public ReadOnly Property SecondaryHandrailHeight As Double
	Get
public:
property double SecondaryHandrailHeight {
	double get ();
}
member SecondaryHandrailHeight : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The rail has no secondary hand rail.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace